// https://github.com/BUI-studies/frontend-exercises/blob/master/js-homeworks/03-objects_string_date.md
/* TASK-01
Доповнити функціонал 2-ї задачі з минулої домашньої роботи. До функції profileMagazine, яка повертає обʼєкт інтернет-магазину з додатковими методами по роботі з ним додати наступні параметри та методи.

Arguments:
description - опис про магазин
Return value
Обʼєкт інтернет магазину, у якого наявні одноіменні аргументам властивості, а також 3 методи - makeBlackFriday, verifySore, ellipsisText, censorshipCheck

метод ellipsisText
Перевіряє максимальну довжину рядка, та за умови якщо рядок перевищує максимульну кількість символів - обрізає рядок та додає "..."

Arguments:
text - текст для перевірки
maxLength - розмір максимальної довжини рядка в числовому значенні
Return value
Якщо максимальна кількість символів не перевищена - рядок без змін. Якщо максимальна кількість символів перевищена - рядок з "..." замість зайвих символів.

метод censorshipCheck
Перевіряє рядок(рекламу магазину) на цензуру, тобто якщо у тексті є заборонене слово то видаляє його по всьому рядку

Arguments:
advertisement - текст(рекламний текст) для перевірки
forbiddenWord - заборонене слово
Return value
Якщо заборонене слово не знайдено - рядок без змін. Якщо заборонене слово присутнє в тексті - оновлений рядок без цього слова.
 */

