/* TASK-03
Напишіть гру для відгадування слова.

Game flow:
Спитати чи користувач хоче зіграти у гру?
Попросити користувача загадати слово.
Для кожного символу у загаданому слові, перевірити чи є такий символ у слові взагалі та чи співпадає здогадка користувача із символом на поточній позиції.
Якщо здогадка користувача вірна - переходити до наступного символу
Якщо здогадка користувача не вірна - повторювати запит символу допоки не набереться 5 помилкових здогадок, далі - вивести в консоль "You lose!". Якщо одна зі здогадок виявилася вірною - переходити на відгадування наступного символу.
Якщо користувач виграв - вивести у консоль "You win!" */

confirm("Хочеш зіграти у гру?");
let word = prompt("Загадай слово");


response? "You win!"  : "You lose!"


mistakesCount = 0;
